Revit 2026 API

# RebarShapeMultiplanarDefinition Methods

---

The RebarShapeMultiplanarDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetPresenceOfSegments | Simultaneously set the presence of all 3D segments. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RebarShapeMultiplanarDefinition Class

Autodesk.Revit.DB.Structure Namespace